
#Область ОбработчикиСобытий

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	// Проверяем наличие записей в регистре сведений onyx_НастройкиAPI
	Если НЕ ПроверитьНаличиеНастроек() Тогда
		// Если настроек нет, открываем помощника первого запуска
		ВыбраннаяФорма = "Обработка.onyx_ПомощникПервогоЗапуска.Форма.Форма";
		// Отключаем стандартную обработку, чтобы использовалась выбранная форма
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры и функции

&НаСервере
Функция ПроверитьНаличиеНастроек()
	
	Возврат РегистрыСведений.onyx_НастройкиAPI.ПроверитьНаличиеНастроек();
	
КонецФункции

#КонецОбласти

#КонецЕсли
